app/controllers/enquiries_controller.rb

UPDATE `users` SET `updated_at` = '2010-11-30 11:09:41', `last_login_at` = '2010-11-30 11:09:41', `last_login_ip` = '0.0.0.0', `current_login_at` = '2010-11-30 11:09:41', `login_count` = 2, `last_request_at` = '2010-11-30 11:09:41' WHERE `id` = 5
---
  def create
    @enquiry = Enquiry.new(params[:enquiry])
    @enquiry.listing = Listing.find(params[:enquiry][:listing_id].to_i)
    @enquiry.user = current_user
    if @enquiry.save