app/controllers/enquiries_controller.rb

  def new
    @enquiry = Enquiry.new
    listing = Listing.find(params[:listing_id])
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 980190972)

  def create
    @enquiry = Enquiry.new(params[:enquiry])
    @listing = Listing.find(params[:enquiry][:listing_id].to_i)
    @enquiry.listing = @listing
    @enquiry.user = current_user
    if @enquiry.save
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 980190972)
INSERT INTO `enquiries` (`comment`, `created_at`, `available_date_to`, `enquiry_type`, `updated_at`, `listing_id`, `user_id`, `available_date_from`, `status`) VALUES('--- \n- Incidunt et excepturi quidem voluptatem reiciendis dolores eos.\n- Necessitatibus id aspernatur in nulla occaecati dolore exercitationem beatae.\n- Consequatur ipsa maxime reiciendis veritatis labore quia assumenda.\n', '2010-12-19 00:35:22', NULL, '--- :application\n', '2010-12-19 00:35:22', 980190967, 9, NULL, 'new')
INSERT INTO `listings` (`price`, `created_at`, `available_date_to`, `updated_at`, `property_id`, `user_id`, `available_date_from`) VALUES(200, '2010-11-30 11:17:24', NULL, '2010-11-30 11:17:24', 980190973, 13, NULL)
INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `updated_at`, `current_login_ip`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('2010-11-30 11:09:41', '2010-11-30 11:09:41', '0f55da604020e3c9fdd2d229e2003f5e4ea26291a8fe5851eeb70ebd394af77aa6c77b45761cc15e55304a9e544afd368067792b6770e5299ee96f5d1020641b', '2010-11-30 11:09:41', '0.0.0.0', '2010-11-30 11:09:41', '321cbcaa3d73d5d5123fd130d3833f20e483e91681f6c5514d60a1a10cb1d0bef06291141f4ede3da3b735a5a00ab4e878a6866408e294b6f39369be84bae11b', 1, NULL, 'edgar', NULL, 'solon@rennergulgowski.biz')

  def show
    @enquiry = Enquiry.find(params[:id])
---
SELECT * FROM `enquiries` WHERE (`enquiries`.`id` = 13)

  def edit
    @enquiry = Enquiry.find(params[:id])
---
SELECT * FROM `enquiries` WHERE (`enquiries`.`id` = 13)

  def update
    @enquiry = Enquiry.find(params[:id])
    if @enquiry.update_attributes(params[:enquiry])
---
SELECT * FROM `enquiries` WHERE (`enquiries`.`id` = 13)
UPDATE `enquiries` SET `updated_at` = '2010-12-19 00:54:24', `available_date_to` = '2011-01-02 00:54:23', `comment` = 'updated comment', `created_at` = '2010-12-19 00:54:24', `available_date_from` = '2010-12-26 00:54:23' WHERE `id` = 18