app/controllers/listings_controller.rb

  def index
    @listings = Listing.find(:all, :include => :property)
---
SELECT * FROM `properties` WHERE (`properties`.`id` IN (980190978,980190979,980190970,980190971,1,980190972,980190973))

  def create
    @listing = Listing.new(params[:listing])
    @property = Property.new(params[:listing][:property])
    @photo = Photo.new(params[:listing][:property][:photo])
    @listing.property = @property
    @listing.user = current_user
    @property.photos = [@photo]
    if @listing.save && @property.save && @photo.save
---
INSERT INTO `listings` (`price`, `created_at`, `available_date_to`, `updated_at`, `property_id`, `user_id`, `available_date_from`) VALUES(200, '2010-11-28 01:01:27', NULL, '2010-11-28 01:01:27', 32, 1, NULL)
INSERT INTO `properties` (`created_at`, `photo_file_size`, `postcode`, `updated_at`, `photo_file_name`, `street_type`, `photo_content_type`, `suburb`, `photo_updated_at`, `street_number`, `street_name`, `state`) VALUES('2010-11-28 03:11:14', NULL, '3121', '2010-11-28 03:11:14', NULL, 'Plaza', NULL, 'Port Jodiestad', NULL, NULL, '4835 Graham View', 'Vic')

  def edit
    @listing = Listing.find(params[:id])
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 24)

  def update
    @listing = Listing.find(params[:id])
    photo = @listing.property.photos.first
    photo_update_result = photo.update_attributes(params[:listing][:property][:photo]) if photo
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 24)
SELECT * FROM `properties` WHERE (`properties`.`id` = 32)
UPDATE `listings` SET `updated_at` = '2010-12-12 06:33:12', `available_date_to` = '2010-08-01' WHERE `id` = 980190972
UPDATE `properties` SET `updated_at` = '2010-12-08 10:56:37', `photo_file_name` = 'Red Apple.gif', `photo_updated_at` = '2010-12-08 10:56:36', `photo_file_size` = 2160, `photo_content_type` = 'image/gif' WHERE `id` = 980190982

  def show
    @listing = Listing.find(params[:id])
    @enquiries = @listing.enquiries.paginate(:page => params[:page], :per_page => 4)
    @my_application = @listing.enquiries.find_all{|e| e.user == current_user && e.enquiry_type == "application"}.first
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 21)
SELECT * FROM `enquiries` WHERE (`enquiries`.listing_id = 980190972) LIMIT 0, 10
SELECT count(*) AS count_all FROM `enquiries` WHERE (`enquiries`.listing_id = 980190972)
SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1

  def approve_enquiry
    @enquiry = Enquiry.find(params[:enquiry_id])
    @enquiry.status = "approved"
    @enquiry.save!
---
SELECT * FROM `enquiries` WHERE (`enquiries`.`id` = 44)
UPDATE `enquiries` SET `updated_at` = '2010-12-19 02:16:20', `status` = 'approved' WHERE `id` = 50