app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT * FROM `listings` LIMIT 1