app/controllers/properties_controller.rb

  def index
    @properties = Property.all
---
SELECT * FROM `properties`

  def create
    @property = Property.new(params[:property])
    if @property.save
---
INSERT INTO `properties` (`created_at`, `photo_file_size`, `postcode`, `updated_at`, `photo_file_name`, `street_type`, `photo_content_type`, `suburb`, `photo_updated_at`, `street_number`, `street_name`, `state`) VALUES('2010-11-28 03:28:22', NULL, NULL, '2010-11-28 03:28:22', NULL, NULL, NULL, NULL, NULL, NULL, 'Butt', NULL)

  def edit
    @property = Property.find(params[:id])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = 12)

  def update
    @property = Property.find(params[:id])
---
SELECT * FROM `properties` WHERE (`properties`.`id` = 21)