app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO `users` (`last_request_at`, `created_at`, `crypted_password`, `updated_at`, `current_login_ip`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES('2010-11-14 07:50:25', '2010-11-14 07:50:25', '0f55da604020e3c9fdd2d229e2003f5e4ea26291a8fe5851eeb70ebd394af77aa6c77b45761cc15e55304a9e544afd368067792b6770e5299ee96f5d1020641b', '2010-11-14 07:50:25', '127.0.0.1', '2010-11-14 07:50:25', '0bd68f596e6efd4987abd2f07fd773ccffac9a473e0cfc2352f4ff290c532fa43befc0a0151d2e9312456fcca3aa73b6df3c79af76f14be6d623a012a601d07f', 1, NULL, 'owenm', NULL, 'owenm@example.com')